In [23]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

satdata = "Resources/clean_data.csv"

satdata = pd.read_csv(satdata)
satdata.head()

,University,CITY,State,ZIP,LATITUDE,LONGITUDE,SAT_AVG_ALL,Total_EMP,Median_income,AVG_income
0,University of Alabama at Birmingham,Birmingham,AL,35294-0110,33.505697,-86.799345,1195,510560,37050,47480
1,University of Alabama in Huntsville,Huntsville,AL,35899,34.724557,-86.640449,1322,226330,39820,54630
2,Alabama State University,Montgomery,AL,36104-0271,32.364317,-86.295677,935,164030,33670,42510
3,The University of Alabama,Tuscaloosa,AL,35487-0166,33.211875,-87.545978,1278,102020,33740,41800
4,Auburn University at Montgomery,Montgomery,AL,36117-3596,32.367360,-86.177544,1083,164030,33670,42510

In [24]:
satdata.columns

Index(['University', 'CITY', 'State', 'ZIP', 'LATITUDE', 'LONGITUDE',
       'SAT_AVG_ALL', 'Total_EMP', 'Median_income', 'AVG_income'],
      dtype='object')

In [25]:
column_table = satdata[["University", "CITY", "State","ZIP", "SAT_AVG_ALL"]]
column_table.head()

,University,CITY,State,ZIP,SAT_AVG_ALL
0,University of Alabama at Birmingham,Birmingham,AL,35294-0110,1195
1,University of Alabama in Huntsville,Huntsville,AL,35899,1322
2,Alabama State University,Montgomery,AL,36104-0271,935
3,The University of Alabama,Tuscaloosa,AL,35487-0166,1278
4,Auburn University at Montgomery,Montgomery,AL,36117-3596,1083

In [26]:
column_table.count()

University     579
CITY           579
State          579
ZIP            579
SAT_AVG_ALL    579
dtype: int64

In [27]:
column_table = column_table.dropna(how='any')
column_table.head()

,University,CITY,State,ZIP,SAT_AVG_ALL
0,University of Alabama at Birmingham,Birmingham,AL,35294-0110,1195
1,University of Alabama in Huntsville,Huntsville,AL,35899,1322
2,Alabama State University,Montgomery,AL,36104-0271,935
3,The University of Alabama,Tuscaloosa,AL,35487-0166,1278
4,Auburn University at Montgomery,Montgomery,AL,36117-3596,1083

In [28]:
column_table.count()

University     579
CITY           579
State          579
ZIP            579
SAT_AVG_ALL    579
dtype: int64